# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [1]:

import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [2]:
a = pd.Series([100,200,300,400])

Print a, and data type

In [3]:
print(a)
print(type(a))

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [4]:
a[2]

300

What are the values of index for series a?

In [5]:
a

0    100
1    200
2    300
3    400
dtype: int64

Change the index to  ['c', 'a', 'b', 'd']

In [6]:

a.index=['c', 'a', 'b', 'd']
a

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [7]:
a.d

400

Sort the values wrt to the index and print it

In [8]:
a.sort_index()

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [9]:
b = pd.Series([800,450,100],index=['e','f','g'])
b

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [10]:
A = pd.concat([a,b])

In [11]:
#print a again after appending b into it

A

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [12]:
sortedindex = a.sort_values(ascending=False).index

In [13]:
sortedindex

Index(['d', 'b', 'a', 'c'], dtype='object')

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [14]:
df = pd.DataFrame(A)

In [15]:
df

     0
c  100
a  200
b  300
d  400
e  800
f  450
g  100

What is the shape of the datafarme <br>
(also, what does it imply?)

In [16]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [17]:
# yep its same as the series.

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [18]:
df.head()

     0
c  100
a  200
b  300
d  400
e  800

In [19]:
df.tail()

     0
b  300
d  400
e  800
f  450
g  100

Rename the column of the dataframe as 'points'

In [20]:

df.rename(columns={'0':'points'},inplace=True)
df.head()

     0
c  100
a  200
b  300
d  400
e  800

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [21]:
#Create fruits array
import numpy as np
fruits =pd.Series(['orange','mango','apple'])

f = pd.Series(np.random.choice(fruits,size=7))
f

0     mango
1     apple
2    orange
3    orange
4    orange
5     mango
6    orange
dtype: object

In [22]:
#Create series fruits out of fruits array

fruits =pd.Series(f)

fruits

0     mango
1     apple
2    orange
3    orange
4    orange
5     mango
6    orange
dtype: object

Change the index of fruits to the index of dataframe df

In [23]:
fruits.index = df.index
fruits

c     mango
a     apple
b    orange
d    orange
e    orange
f     mango
g    orange
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [43]:
df['fruits'] = fruits

df.head()

     0  fruits   fruit
c  100   mango   mango
a  200   apple   apple
b  300  orange  orange
d  400  orange  orange
e  800  orange  orange

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [45]:
d1 = pd.DataFrame({ 'city' : ['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali' ] ,
                   'Temperature' : [15, 22, 20, 26,-2]
    
})

Print(d1)

In [46]:
d1

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [47]:

d1.shape

(5, 2)

Set city = d1['city']

In [49]:
city = d1['city']

print city <br>
What is the type of city.

In [51]:
print(city)
print(type(city))

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object
<class 'pandas.core.series.Series'>

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [53]:
d2 = pd.DataFrame({
    'city':['Bengalaru','Coimbatore','Srirangam','Pondicherry'],
    'Temperature':[24,35,36,39]
})

d2.head()

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [54]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [57]:
d3 = pd.concat([d1,d2],ignore_index=True)


d3.head()

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [67]:
cold_cities = d3[d3['Temperature'] <= 20]
cold_cities

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [69]:

hot_cities = d3[d3['Temperature'] >= 35]
hot_cities

          city  Temperature
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [70]:
# write function here

def is_ut(x):
    return x in ['Chandigarh', 'Pondicherry' , 'Delhi']

d3['is_ut'] = d3['city'].apply(is_ut)

In [71]:
# print d3
print(d3)

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
5    Bengalaru           24  False
6   Coimbatore           35  False
7    Srirangam           36  False
8  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [72]:
# write function here
def c_to_f(celsius):
    return (celsius * 9/5) + 32

In [74]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
d3['Temperature_F'] = d3['Temperature'].apply(c_to_f)

d3

          city  Temperature  is_ut  Temperature_F
0   Chandigarh           15   True           59.0
1        Delhi           22   True           71.6
2       Kanpur           20  False           68.0
3      Chennai           26  False           78.8
4       Manali           -2  False           28.4
5    Bengalaru           24  False           75.2
6   Coimbatore           35  False           95.0
7    Srirangam           36  False           96.8
8  Pondicherry           39   True          102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [78]:
# d1['is_ut'] = d1['city'].apply(is_ut)
# d1['is_ut']

ut_list = ['Chandigarh', 'Delhi', 'Pondicherry']

# Selecting only Union Territory cities from d1
ut_cities_d1 = d1[d1['city'].isin(ut_list)]

# Printing the subset DataFrame
print(ut_cities_d1)

         city  Temperature  is_ut
0  Chandigarh           15   True
1       Delhi           22   True

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [80]:

d1['Temperature_F'] = d1['Temperature'].apply(c_to_f)

# Selecting cities with temperature above 90°F
hot_cities_d1 = d1[d1['Temperature_F'] > 90]

# Printing the subset DataFrame
print(hot_cities_d1)

Empty DataFrame
Columns: [city, Temperature, is_ut, Temperature_F]
Index: []

Select only the first three rows of the dataframe d1.

In [87]:
# d1[:3]
d1.iloc[:3]

         city  Temperature  is_ut  Temperature_F
0  Chandigarh           15   True           59.0
1       Delhi           22   True           71.6
2      Kanpur           20  False           68.0

Select all the rows and last two columns in the dataframe.

In [90]:
d1.iloc[:, -2:]

   is_ut  Temperature_F
0   True           59.0
1   True           71.6
2  False           68.0
3  False           78.8
4  False           28.4

## Groupby

In [92]:
# Create a dataframe using dictionary of your choice

data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Math_Score': [85, 92, 78, 88, 95],
    'English_Score': [78, 85, 88, 91, 93]
}


df = pd.DataFrame(data)

In [98]:
# Use Groupby of single column with aggregate sum()

gp = df.groupby('Student').sum()
gp

         Math_Score  English_Score
Student
Alice            85             78
Bob              92             85
Charlie          78             88
David            88             91
Eva              95             93

In [100]:
# Use Groupby of single column with aggregate count()

df.groupby('Student').count()

         Math_Score  English_Score
Student
Alice             1              1
Bob               1              1
Charlie           1              1
David             1              1
Eva               1              1

In [107]:
# Use Groupby of single column with aggregate min() and max()
grouped_min_max_df= df.groupby('Student').agg({'Math_Score':['min','max'],'English_Score':['min','max']})

grouped_min_max_df = grouped_min_max_df.sort_values(('Math_Score', 'min'))
grouped_min_max_df

        Math_Score     English_Score
               min max           min max
Student
Charlie         78  78            88  88
Alice           85  85            78  78
David           88  88            91  91
Bob             92  92            85  85
Eva             95  95            93  93

In [109]:
# Use Groupby of any 2 columns with aggregate mean()

df.groupby(['Student', 'Math_Score']).mean()

                    English_Score
Student Math_Score
Alice   85                   78.0
Bob     92                   85.0
Charlie 78                   88.0
David   88                   91.0
Eva     95                   93.0

In [110]:
# Use Groupby of any 2 columns with aggregate min() and max()

df.groupby(['Student', 'Math_Score']).agg({'Math_Score': ['min', 'max'], 'English_Score': ['min', 'max']})

                   Math_Score     English_Score
                          min max           min max
Student Math_Score
Alice   85                 85  85            78  78
Bob     92                 92  92            85  85
Charlie 78                 78  78            88  88
David   88                 88  88            91  91
Eva     95                 95  95            93  93

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [111]:
a =pd.date_range(start='2020-01-01',end='2021-04-01') 

a[:5]

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05'],
              dtype='datetime64[ns]', freq='D')

print a

In [112]:
print(a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [113]:
print(len(a))

457

What is the type of a?

In [114]:
print(type(a))

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>